sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe0 0x00u         /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u         /*!<@brief Input Buffer Enable: Enables */
#define PCR_PFE_pfe1 0x01u         /*!<@brief Passive Filter Enable: Enables */
#define PORT0_PCR0_MUX_mux01 0x01u /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT0_PCR1_MUX_mux01 0x01u /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT2_PCR2_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR4_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR5_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT1_8 (number 2), LCD_RS232_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LCD_RS232_RX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_RS232_RX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_RS232_RX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_9 (number 3), LCD_RS232_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LCD_RS232_TX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_RS232_TX_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_RS232_TX_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_5 (number 19), ADC_IN2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC_IN2_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_IN2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC_IN2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_6 (number 20), ADC_IN4
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC_IN4_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_IN4_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC_IN4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_13 (number 23), ADC_IN6
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC_IN6_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_IN6_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC_IN6_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_11 (number 5), ADC_IN9
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC_IN9_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_IN9_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC_IN9_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_1 (number 15), ADC_IN1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC_IN1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_IN1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC_IN1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_15 (number 24), SPI_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_MOSI_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_MOSI_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_MOSI_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_8 (number 42), SPI_MISO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_MISO_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_MISO_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_MISO_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_12 (number 22), SPI_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_SCK_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SCK_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SCK_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_13 (number 7), I2C_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C_SCL_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C_SCL_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C_SCL_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_12 (number 6), I2C_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C_SDA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C_SDA_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C_SDA_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_3 (number 17), Modbus_Master_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Modbus_Master_RX_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Modbus_Master_RX_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Modbus_Master_RX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT2_4 (number 18), MASTER_RS485_DE
  @{ */

