sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MASTER_RS485_DE_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MASTER_RS485_DE_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MASTER_RS485_DE_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MASTER_RS485_DE_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MASTER_RS485_DE_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MASTER_RS485_DE_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MASTER_RS485_DE_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT3_13 (number 37), Modbus_Slave_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Modbus_Slave_RX_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Modbus_Slave_RX_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Modbus_Slave_RX_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT3_12 (number 38), Modbus_Slave_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Modbus_Slave_TX_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Modbus_Slave_TX_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Modbus_Slave_TX_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT3_28 (number 33), BLE_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_RX_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_RX_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_RX_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_7 (number 21), BLE_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_TX_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT0_2 (number 51), OUTPUT_KEY_O1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OUTPUT_KEY_O1_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O1_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_OUTPUT_KEY_O1_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O1_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OUTPUT_KEY_O1_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_3 (number 52), OUTPUT_KEY_O2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OUTPUT_KEY_O2_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O2_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_OUTPUT_KEY_O2_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O2_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OUTPUT_KEY_O2_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_6 (number 53), OUTPUT_KEY_O3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OUTPUT_KEY_O3_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O3_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_OUTPUT_KEY_O3_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O3_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OUTPUT_KEY_O3_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_16 (number 54), OUTPUT_KEY_O4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OUTPUT_KEY_O4_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O4_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_OUTPUT_KEY_O4_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O4_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OUTPUT_KEY_O4_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O4_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O4_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT0_17 (number 55), OUTPUT_KEY_O5
  @{ */

