sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OUTPUT_KEY_O5_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O5_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_OUTPUT_KEY_O5_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O5_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OUTPUT_KEY_O5_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_KEY_O5_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OUTPUT_KEY_O5_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT2_2 (number 16), OUTPUT_DAC_PWR
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OUTPUT_DAC_PWR_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OUTPUT_DAC_PWR_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OUTPUT_DAC_PWR_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT3_15 (number 35), Modbus_Master_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Modbus_Master_TX_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Modbus_Master_TX_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Modbus_Master_TX_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT3_0 (number 46), PWM_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWM_OUT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWM_OUT_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWM_OUT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_0 (number 56), INPUT_IN1        
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_IN1_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_IN1_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_IN1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_IN1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_IN1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_IN1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_1 (number 57), INPUT_IN10       
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_IN10_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_IN10_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_IN10_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_IN10_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_IN10_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_IN10_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_2 (number 58), INPUT_KEY6       
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_KEY6_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY6_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_KEY6_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_KEY6_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY6_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_KEY6_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_3 (number 59), INPUT_KEY5       
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_KEY5_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY5_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_KEY5_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_KEY5_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY5_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_KEY5_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_4 (number 62), INPUT_KEY4       
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_KEY4_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY4_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_KEY4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_KEY4_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_KEY4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_5 (number 63), INPUT_KEY3
  @{ */

