sfjagsf/r-t-t-h-r-e-a-d/.sdk_extract/boards/frdmmcxa266/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_KEY3_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY3_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_KEY3_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_KEY3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY3_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_KEY3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_6 (number 64), INPUT_KEY2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_KEY2_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY2_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_KEY2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_KEY2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_KEY2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_KEY2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_7 (number 1), INPUT_IN5        
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_INPUT_IN5_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_INPUT_IN5_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_INPUT_IN5_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_INPUT_IN5_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_INPUT_IN5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_INPUT_IN5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
